micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_utils.c
/**
  ******************************************************************************
  * @file    stm32n6xx_ll_utils.c
  * @author  MCD Application Team
  * @brief   UTILS LL module driver.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_ll_utils.h"
#include "stm32n6xx_ll_pwr.h"

#ifdef  USE_FULL_ASSERT
#include "stm32_assert.h"
#else
#define assert_param(expr) ((void)0U)
#endif /* USE_FULL_ASSERT */

/** @addtogroup STM32N6xx_LL_Driver
  * @{
  */

/** @addtogroup UTILS_LL
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @addtogroup UTILS_LL_Private_Constants
  * @{
  */
#define UTILS_MAX_FREQUENCY_SCALE0  800000000U      /*!< Maximum frequency for system clock at power scale 0, in Hz */
#define UTILS_MAX_FREQUENCY_SCALE1  600000000U      /*!< Maximum frequency for system clock at power scale 1, in Hz */

#define UTILS_PLLVCO_INPUT_MAX       50000000U      /*!< Frequency max for the PLLVCO input, in Hz  */
#define UTILS_PLLVCO_OUTPUT_MAX    3200000000U      /*!< Frequency max for the PLLVCO output, in Hz */
/* Defines used for HSE range */
#define UTILS_HSE_FREQUENCY_MIN         16000000U   /*!< Frequency min for HSE frequency, in Hz   */
#define UTILS_HSE_FREQUENCY_MAX         48000000U   /*!< Frequency max for HSE frequency, in Hz   */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/
/** @addtogroup UTILS_LL_Private_Macros
  * @{
  */
#define IS_LL_UTILS_AHB_DIV(__VALUE__)    (((__VALUE__) == LL_RCC_AHB_DIV_1) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_2) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_4) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_8) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_16) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_64) \
                                           || ((__VALUE__) == LL_RCC_AHB_DIV_128))

#define IS_LL_UTILS_APB1_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB1_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_16) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_32) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_64) \
                                         || ((__VALUE__) == LL_RCC_APB1_DIV_128))

#define IS_LL_UTILS_APB2_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB2_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_16) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_32) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_64) \
                                         || ((__VALUE__) == LL_RCC_APB2_DIV_128))

#define IS_LL_UTILS_APB4_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB4_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_16) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_32) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_64) \
                                         || ((__VALUE__) == LL_RCC_APB4_DIV_128))

#define IS_LL_UTILS_APB5_DIV(__VALUE__) (((__VALUE__) == LL_RCC_APB5_DIV_1) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_2) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_4) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_8) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_16) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_32) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_64) \
                                         || ((__VALUE__) == LL_RCC_APB5_DIV_128))

/* Values expected to use PLL in Integer mode */
#define IS_LL_UTILS_PLLM_VALUE(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 63U))

#define IS_LL_UTILS_PLLN_VALUE(__VALUE__) ((16U <= (__VALUE__)) && ((__VALUE__) <= 640U))

#define IS_LL_UTILS_PLLP_VALUE(__VALUE__) ((1U <= (__VALUE__)) && ((__VALUE__) <= 7U))

#define IS_LL_UTILS_FRACN_VALUE(__VALUE__) ((__VALUE__) == 0U)

#define IS_LL_UTILS_PLLVCO_INPUT(__VALUE__) ((__VALUE__) <= UTILS_PLLVCO_INPUT_MAX)

#define IS_LL_UTILS_PLLVCO_OUTPUT(__VALUE__) ((__VALUE__) <= UTILS_PLLVCO_OUTPUT_MAX)

#define IS_LL_UTILS_HSE_BYPASS(__STATE__) \
  (((__STATE__) == LL_UTILS_HSEBYPASS_ON) || ((__STATE__) == LL_UTILS_HSEBYPASS_OFF))

