micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_utils.c
      /* Enable PLL and switch CPU/system clock to PLL */
      status = UTILS_EnablePLL1AndSwitchSystem(pllfreq / pUTILS_ICInitStruct->IC1Divider, pUTILS_ClkInitStruct);
    }
    else
    {
      status = ERROR;
    }
  }
  else
  {
    /* Current PLL configuration cannot be modified */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  This function configures the CPU system clock with MSI as clock source of the PLL1
  *         used in integer mode.
  * @note   The application needs to ensure that PLL1 is disabled.
  * @note   Function is based on the following formula:
  *         - PLL output frequency = (((MSI frequency / PLLM) * PLLN) / PLLP1 / PLLP2)
  *         - PLLM: ensure that the VCO input frequency ranges from 1 to 50 MHz (PLLVCO_input = MSI frequency / PLLM)
  *         - PLLN: ensure that the VCO output frequency is maximum 3200 MHz (PLLVCO_output = PLLVCO_input * PLLN)
  *         - PLLP1, PLLP2: ensure that max frequency at 800 MHz is reached (PLLVCO_output / PLLP1 / PLLP2)
  * @param  pUTILS_PLLInitStruct pointer to a @ref LL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @param  pUTILS_ICInitStruct pointer to a @ref LL_UTILS_ICInitTypeDef structure that contains
  *                             the configuration information for the IC.
  * @param  pUTILS_ClkInitStruct pointer to a @ref LL_UTILS_ClkInitTypeDef structure that contains
  *                             the configuration information for the BUS prescalers.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: Max frequency configuration done
  *          - ERROR: Max frequency configuration not done
  *
  */
ErrorStatus LL_PLL_ConfigSystemClock_MSI(const LL_UTILS_PLLInitTypeDef *pUTILS_PLLInitStruct,
                                         const LL_UTILS_ICInitTypeDef  *pUTILS_ICInitStruct,
                                         const LL_UTILS_ClkInitTypeDef *pUTILS_ClkInitStruct)
{
  ErrorStatus status;
  uint32_t pllfreq;

  /* Check the PLL parameters */
  assert_param(IS_LL_UTILS_PLLM_VALUE(pUTILS_PLLInitStruct->PLLM));
  assert_param(IS_LL_UTILS_PLLN_VALUE(pUTILS_PLLInitStruct->PLLN));
  assert_param(IS_LL_UTILS_PLLP_VALUE(pUTILS_PLLInitStruct->PLLP1));
  assert_param(IS_LL_UTILS_PLLP_VALUE(pUTILS_PLLInitStruct->PLLP2));
  assert_param(IS_LL_UTILS_FRACN_VALUE(pUTILS_PLLInitStruct->FRACN));

  /* Check VCO Input frequency */
  assert_param(IS_LL_UTILS_PLLVCO_INPUT(MSI_VALUE / pUTILS_PLLInitStruct->PLLM));

  /* Check that PLL1 is not enabled and thus ready for configuration */
  if (LL_RCC_PLL1_IsReady() != 1U)
  {
    /* Integer mode only */
    if (pUTILS_PLLInitStruct->FRACN == 0U)
    {
      /* Calculate the new PLL output frequency */
      pllfreq = LL_RCC_CalcPLLClockFreq(MSI_VALUE, pUTILS_PLLInitStruct->PLLM,
                                        pUTILS_PLLInitStruct->PLLN, pUTILS_PLLInitStruct->FRACN,
                                        pUTILS_PLLInitStruct->PLLP1, pUTILS_PLLInitStruct->PLLP2);

      /* Check VCO Output frequency */
      assert_param(IS_LL_UTILS_PLLVCO_OUTPUT(pllfreq * pUTILS_PLLInitStruct->PLLP1 * pUTILS_PLLInitStruct->PLLP2));

      /* Enable MSI if not enabled */
      if (LL_RCC_MSI_IsReady() != 1U)
      {
        LL_RCC_MSI_Enable();
        while (LL_RCC_MSI_IsReady() != 1U)
        {
          /* Wait for MSI ready */
        }
      }

      /* Configure PLL1 */
      LL_RCC_PLL1_SetSource(LL_RCC_PLLSOURCE_MSI);

      UTILS_ConfigurePLL1InIntegerMode(pUTILS_PLLInitStruct);

      UTILS_ConfigureIC(pUTILS_ICInitStruct);

      /* Enable PLL and switch system clock to PLL */
      status = UTILS_EnablePLL1AndSwitchSystem(pllfreq / pUTILS_ICInitStruct->IC1Divider, pUTILS_ClkInitStruct);
    }
    else
    {
      status = ERROR;
    }
  }
  else
  {
    /* Current PLL configuration cannot be modified */
    status = ERROR;
  }

  return status;
}

/**
  * @brief  This function configures the CPU system clock with HSE as clock source of the PLL1
  *         used in integer mode.
  * @note   The application needs to ensure that PLL1 is disabled.
  * @note   Function is based on the following formula:
  *         - PLL output frequency = (((HSE frequency / PLLM) * PLLN) / PLLP1 / PLLP2)
  *         - PLLM: ensure that the VCO input frequency ranges from 1 to 50 MHz (PLLVCO_input = HSE frequency / PLLM)
  *         - PLLN: ensure that the VCO output frequency is maximum 3200 MHz (PLLVCO_output = PLLVCO_input * PLLN)
  *         - PLLP1, PLLP2: ensure that max frequency at 800 MHz is reached (PLLVCO_output / PLLP1 / PLLP2)
  * @param  HSEFrequency Value between Min_Data = 4000000 and Max_Data = 50000000
  * @param  HSEBypass This parameter can be one of the following values:
  *         @arg @ref LL_UTILS_HSEBYPASS_ON
  *         @arg @ref LL_UTILS_HSEBYPASS_OFF
  * @param  pUTILS_PLLInitStruct pointer to a @ref LL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @param  pUTILS_ICInitStruct pointer to a @ref LL_UTILS_ICInitTypeDef structure that contains
  *                             the configuration information for the IC.
  * @param  pUTILS_ClkInitStruct pointer to a @ref LL_UTILS_ClkInitTypeDef structure that contains
  *                             the configuration information for the BUS prescalers.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: Max frequency configuration done
  *          - ERROR: Max frequency configuration not done
  *
  */
ErrorStatus LL_PLL_ConfigSystemClock_HSE(uint32_t HSEFrequency, uint32_t HSEBypass,
                                         const LL_UTILS_PLLInitTypeDef *pUTILS_PLLInitStruct,
                                         const LL_UTILS_ICInitTypeDef  *pUTILS_ICInitStruct,
                                         const LL_UTILS_ClkInitTypeDef *pUTILS_ClkInitStruct)
{
  ErrorStatus status;
  uint32_t pllfreq;

  /* Check the HSE parameters */
  assert_param(IS_LL_UTILS_HSE_FREQUENCY(HSEFrequency));
  assert_param(IS_LL_UTILS_HSE_BYPASS(HSEBypass));
  /* Check the PLL parameters */
  assert_param(IS_LL_UTILS_PLLM_VALUE(pUTILS_PLLInitStruct->PLLM));
  assert_param(IS_LL_UTILS_PLLN_VALUE(pUTILS_PLLInitStruct->PLLN));
  assert_param(IS_LL_UTILS_PLLP_VALUE(pUTILS_PLLInitStruct->PLLP1));
  assert_param(IS_LL_UTILS_PLLP_VALUE(pUTILS_PLLInitStruct->PLLP2));
  assert_param(IS_LL_UTILS_FRACN_VALUE(pUTILS_PLLInitStruct->FRACN));

  /* Check VCO Input frequency */
  assert_param(IS_LL_UTILS_PLLVCO_INPUT(HSEFrequency / pUTILS_PLLInitStruct->PLLM));

