micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Src/stm32n6xx_ll_utils.c
  /* Check that PLL1 is not enabled and thus ready for configuration */
  if (LL_RCC_PLL1_IsReady() != 1U)
  {
    /* Integer mode only */
    if (pUTILS_PLLInitStruct->FRACN == 0U)
    {
      /* Calculate the new PLL output frequency */
      pllfreq = LL_RCC_CalcPLLClockFreq(HSEFrequency, pUTILS_PLLInitStruct->PLLM,
                                        pUTILS_PLLInitStruct->PLLN, pUTILS_PLLInitStruct->FRACN,
                                        pUTILS_PLLInitStruct->PLLP1, pUTILS_PLLInitStruct->PLLP2);

      /* Check VCO Output frequency */
      assert_param(IS_LL_UTILS_PLLVCO_OUTPUT(pllfreq * pUTILS_PLLInitStruct->PLLP1 * pUTILS_PLLInitStruct->PLLP2));

      /* Enable HSE if not enabled */
      if (LL_RCC_HSE_IsReady() != 1U)
      {
        /* Check if need to enable HSE bypass feature or not */
        if (HSEBypass == LL_UTILS_HSEBYPASS_ON)
        {
          LL_RCC_HSE_EnableBypass();
        }
        else
        {
          LL_RCC_HSE_DisableBypass();
        }

        /* Enable HSE */
        LL_RCC_HSE_Enable();
        while (LL_RCC_HSE_IsReady() != 1U)
        {
          /* Wait for HSE ready */
        }
      }

      /* Configure PLL1 */
      LL_RCC_PLL1_SetSource(LL_RCC_PLLSOURCE_HSE);

      UTILS_ConfigurePLL1InIntegerMode(pUTILS_PLLInitStruct);

      UTILS_ConfigureIC(pUTILS_ICInitStruct);

      /* Enable PLL and switch system clock to PLL */
      status = UTILS_EnablePLL1AndSwitchSystem(pllfreq / pUTILS_ICInitStruct->IC1Divider, pUTILS_ClkInitStruct);
    }
    else
    {
      status = ERROR;
    }
  }
  else
  {
    /* Current PLL configuration cannot be modified */
    status = ERROR;
  }

  return status;
}

/**
  * @}
  */

/**
  * @}
  */

/** @addtogroup UTILS_LL_Private_Functions
  * @{
  */


/**
  * @brief  Function to configure PLL1 in Integer mode
  * @param  pUTILS_PLLInitStruct pointer to a @ref LL_UTILS_PLLInitTypeDef structure that contains
  *                             the configuration information for the PLL.
  * @retval None
  */
static void UTILS_ConfigurePLL1InIntegerMode(const LL_UTILS_PLLInitTypeDef *pUTILS_PLLInitStruct)
{
  LL_RCC_PLL1_DisableModulationSpreadSpectrum();
  LL_RCC_PLL1_SetM(pUTILS_PLLInitStruct->PLLM);
  LL_RCC_PLL1_SetN(pUTILS_PLLInitStruct->PLLN);
  LL_RCC_PLL1_SetFRACN(pUTILS_PLLInitStruct->FRACN);
  LL_RCC_PLL1_DisableFractionalModulationSpreadSpectrum();
  LL_RCC_PLL1_AssertModulationSpreadSpectrumReset();
  LL_RCC_PLL1_SetP1(pUTILS_PLLInitStruct->PLLP1);
  LL_RCC_PLL1_SetP2(pUTILS_PLLInitStruct->PLLP2);
}

/**
  * @brief  Function to configure IC for CPU/System buses clocks
  * @param  pUTILS_ICInitStruct pointer to a @ref LL_UTILS_ICInitTypeDef structure that contains
  *                             the configuration information for the IC (IC1, IC2, IC6 and IC11).
  * @retval None
  */
static void UTILS_ConfigureIC(const LL_UTILS_ICInitTypeDef *pUTILS_ICInitStruct)
{
  /* Configure and enable each IC used for CPU/System buses clocks */
  LL_RCC_IC1_SetSource(pUTILS_ICInitStruct->IC1Source);
  LL_RCC_IC1_SetDivider(pUTILS_ICInitStruct->IC1Divider);
  LL_RCC_IC1_Enable();
  LL_RCC_IC2_SetSource(pUTILS_ICInitStruct->IC2Source);
  LL_RCC_IC2_SetDivider(pUTILS_ICInitStruct->IC2Divider);
  LL_RCC_IC2_Enable();
  LL_RCC_IC6_SetSource(pUTILS_ICInitStruct->IC6Source);
  LL_RCC_IC6_SetDivider(pUTILS_ICInitStruct->IC6Divider);
  LL_RCC_IC6_Enable();
  LL_RCC_IC11_SetSource(pUTILS_ICInitStruct->IC11Source);
  LL_RCC_IC11_SetDivider(pUTILS_ICInitStruct->IC11Divider);
  LL_RCC_IC11_Enable();
}

/**
  * @brief  Function to enable PLL1 and switch CPU/system clock to PLL
  * @param  CPU_Frequency CPU frequency
  * @param  pUTILS_ClkInitStruct pointer to a @ref LL_UTILS_ClkInitTypeDef structure that contains
  *                             the configuration information for the BUS prescalers.
  * @retval An ErrorStatus enumeration value:
  *          - SUCCESS: No problem to switch system to PLL
  *          - ERROR: Problem to switch system to PLL
  */
static ErrorStatus UTILS_EnablePLL1AndSwitchSystem(uint32_t CPU_Frequency,
                                                   const LL_UTILS_ClkInitTypeDef *pUTILS_ClkInitStruct)
{
  ErrorStatus status = SUCCESS;

  assert_param(IS_LL_UTILS_AHB_DIV(pUTILS_ClkInitStruct->AHBCLKDivider));
  assert_param(IS_LL_UTILS_APB1_DIV(pUTILS_ClkInitStruct->APB1CLKDivider));
  assert_param(IS_LL_UTILS_APB2_DIV(pUTILS_ClkInitStruct->APB2CLKDivider));
  assert_param(IS_LL_UTILS_APB4_DIV(pUTILS_ClkInitStruct->APB4CLKDivider));
  assert_param(IS_LL_UTILS_APB5_DIV(pUTILS_ClkInitStruct->APB5CLKDivider));

  /* Update system clock configuration */
  /* Enable PLL1 */
  LL_RCC_PLL1_Enable();
  while (LL_RCC_PLL1_IsReady() != 1U)
  {
    /* Wait for PLL1 ready */
  }

  LL_RCC_PLL1P_Enable();

  /* Set APBx prescalers to the highest divider */
  LL_RCC_SetAPB1Prescaler(LL_RCC_APB1_DIV_128);
  LL_RCC_SetAPB2Prescaler(LL_RCC_APB2_DIV_128);
  LL_RCC_SetAPB4Prescaler(LL_RCC_APB4_DIV_128);
  LL_RCC_SetAPB5Prescaler(LL_RCC_APB5_DIV_128);

  /* Set AHB prescaler*/
  LL_RCC_SetAHBPrescaler(pUTILS_ClkInitStruct->AHBCLKDivider);

  /* CPU clock switch on the IC1 */
  LL_RCC_SetCpuClkSource(LL_RCC_CPU_CLKSOURCE_IC1);
  while (LL_RCC_GetCpuClkSource() != LL_RCC_CPU_CLKSOURCE_STATUS_IC1)
  {
    /* Wait for CPU clock switch to IC1 */
  }

  /* System buses clock switch on the IC2, IC6 and IC11 */
  LL_RCC_SetSysClkSource(LL_RCC_SYS_CLKSOURCE_IC2_IC6_IC11);
  while (LL_RCC_GetSysClkSource() != LL_RCC_SYS_CLKSOURCE_STATUS_IC2_IC6_IC11)
  {
    /* Wait for System buses clock switch to IC2, IC6 and IC11 */
  }

  LL_SetSystemCoreClock(CPU_Frequency);

  /* Set APBx prescalers */
  LL_RCC_SetAPB1Prescaler(pUTILS_ClkInitStruct->APB1CLKDivider);
  LL_RCC_SetAPB2Prescaler(pUTILS_ClkInitStruct->APB2CLKDivider);
  LL_RCC_SetAPB4Prescaler(pUTILS_ClkInitStruct->APB4CLKDivider);
  LL_RCC_SetAPB5Prescaler(pUTILS_ClkInitStruct->APB5CLKDivider);

  return status;
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
